{
    "country": "Mongolia",
    "report_date": "2025-06-05",
    "inflation": {
      "recent_annual_inflation_pct": 9.0,
      "historical_inflation_pct": [15.15, 10.35, 9.0],
      "commentary": "Mongolia's inflation rate decreased from a peak of 15.15% in 2022 to 9.0% in 2024, aligning with the Bank of Mongolia's target band of 6±2%. This decline is attributed to softer import prices and a slight appreciation of the tugrik. However, core inflation remains elevated due to robust domestic demand and rapid credit growth, prompting the central bank to tighten reserve requirements and debt service-to-income limits for consumer loans."
    },
    "fx": {
      "recent_usd_mnt_rate": 3392.02,
      "historical_usd_mnt_rates": [2850.0, 3100.0, 3392.02],
      "volatility_commentary": "The Mongolian tugrik has depreciated against the US dollar over the past three years, with the average exchange rate rising from 2850.0 in 2022 to 3392.02 in 2024. This depreciation reflects Mongolia's external vulnerabilities, including a current account deficit and reliance on commodity exports. However, foreign exchange reserves have remained stable, supported by foreign direct investment and external financing."
    },
    "macro_risks": [
      "Climate-related shocks, notably the severe 2023–2024 dzud causing significant livestock losses.",
      "Political instability following the resignation of Prime Minister Oyun-Erdene amid corruption allegations.",
      "Fiscal expansion leading to increased public debt and potential inflationary pressures.",
      "Dependence on commodity exports, particularly to China, exposing the economy to external demand fluctuations.",
      "Rising household debt levels due to rapid credit growth in the banking sector."
    ],
    "sources": [
      "https://www.montsame.mn/en/read/361132",
      "https://tradingeconomics.com/mongolia/inflation-cpi",
      "https://montsame.mn/en/read/356003",
      "https://www.worldbank.org/en/news/press-release/2024/05/10/mongolia-s-economy-recovering-risks-remain-world-bank-report",
      "https://www.imf.org/en/News/Articles/2024/10/14/mcs-mongolia-concluding-statement-of-the-2024-imf-staff-visit",
      "https://time.com/7290686/mongolia-prime-minister-oyun-erdene-luvsannamsrain-resigns-protests-corruption-son/",
      "https://apnews.com/article/35f9ba81883ae38385c391a1c8305800"
    ]
  }
  