{
    "cash_flow_statement": {
      "cfs_component_placeholder": {
        "description": "A concise, AI-generated explanation of what this line item represents. This is for human readability and audit purposes.",
        "level": "component",
        "subtotal_of": "cfs_subtotal_placeholder",
        "calculation_template": "[balance_sheet.some_asset] - [balance_sheet.some_asset_prior]"
      },
      "cfs_subtotal_placeholder": {
        "description": "A subtotal that aggregates one or more component-level items.",
        "level": "subtotal",
        "subtotal_of": "cfs_total_placeholder",
        "calculation_template": null
      },
      "cfs_total_placeholder": {
        "description": "A final total, typically representing the sum of subtotals.",
        "level": "total",
        "subtotal_of": null,
        "calculation_template": null
      }
    },
    "__metadata_definitions__": {
      "description": "This section defines the valid properties for each line item in the generated schema. The JIT Engine's output MUST conform to these definitions.",
      "properties": {
        "description": {
          "purpose": "A human-readable explanation of the line item's financial meaning, generated by the JIT Engine for auditability."
        },
        "level": {
          "purpose": "Defines the item's position in the summation hierarchy, which dictates the calculation order for the Derivator Engine.",
          "enum": [
            "component",
            "subtotal",
            "total"
          ]
        },
        "subtotal_of": {
          "purpose": "The key of the parent item to which this item's value contributes. This property builds the summation tree for the Derivator Engine. The value MUST be another key within the `cash_flow_statement` object. It MUST be `null` if the item is a top-level total (e.g., 'ending_cash_balance')."
        },
        "calculation_template": {
          "purpose": "The explicit, machine-executable formula for calculating the value of a 'component'-level item. This property is the logical core of the derivation process. It MUST be 'null' for 'subtotal' and 'total' items, as their values are derived from the hierarchy.",
          "type": [
            "string",
            "null"
          ],
          "format": {
            "syntax": "A standard mathematical expression string.",
            "operands": "Financial data points are referenced using the format '[statement_name.canonical_item_name]'. The Derivator Engine will parse this and retrieve the corresponding value.",
            "prior_period_reference": "To reference the value from the previous period (t-1), the suffix '_prior' MUST be appended within the brackets: '[statement_name.canonical_item_name_prior]'.",
            "operators": "Supported operators are: +, -, *, /. Parentheses () are supported for controlling the order of operations.",
            "example": "'-1 * ([balance_sheet.fixed_assets_net] - [balance_sheet.fixed_assets_net_prior] - [income_statement.is_depreciation_amortization])'"
          }
        }
      }
    }
  }